{
  "blogs": {
    "blog-1": {
      "id": "blog-1",
      "slug": "driving-with-confidence",
      "title": "Driving with Confidence: The Crucial Role of Routine Car Maintenance",
      "description": "Your car is more than just a means of getting from point A to point B; it's a reliable companion on your daily journey. Just like any dependable friend, your car requires regular care to ensure it remains in peak condition.",
      "imageUrl": "assets/img/single-blog.jpg",
      "author": "Admin",
      "timestamp": 1697500800000,
      "content": [
        {
          "title": "1. Safety on the Road:",
          "content": "Safety should always be the top priority when it comes to your vehicle. Regular maintenance checks, including brake inspections, tire rotations, and fluid top-ups, are vital for preventing potential issues that could compromise your safety on the road."
        },
        {
          "title": "2. Longevity and Durability:",
          "content": "Your car is a significant investment, and routine maintenance is the key to protecting that investment. Regular oil changes, filter replacements, and scheduled check-ups contribute to the longevity and durability of your vehicle."
        },
        {
          "title": "3. Improved Performance and Fuel Efficiency:",
          "content": "A well-maintained car performs at its best. Regular tune-ups, air filter replacements, and fuel system cleanings contribute to smoother operation and improved fuel efficiency."
        },
        {
          "title": "4. Prevention is Cheaper Than Cure:",
          "content": "Addressing minor issues during routine maintenance can save you from major, costly repairs down the road. Ignoring warning signs or delaying maintenance might seem like a short-term cost-saving measure, but it often leads to more extensive and expensive problems."
        }
      ]
    },
    "blog-2": {
      "id": "blog-2", 
      "slug": "garage-to-glory",
      "title": "From Garage to Glory: Transform Your Vehicle's Health",
      "description": "Transform your vehicle from ordinary to extraordinary with our comprehensive maintenance and repair services. Discover how proper care can extend your car's life.",
      "imageUrl": "assets/img/blog_4.jpg",
      "author": "Technical Team",
      "timestamp": 1697587200000,
      "content": "Complete content here as a string, or use array format like blog-1"
    },
    "blog-3": {
      "id": "blog-3",
      "slug": "vehicle-health-tips",
      "title": "Essential Vehicle Health Tips for Every Driver",
      "description": "Learn the essential tips every driver should know to keep their vehicle in top condition throughout the year.",
      "imageUrl": "assets/img/blog_5.jpg", 
      "author": "Car Expert",
      "timestamp": 1697673600000,
      "content": "String format content goes here. You can use \\n for line breaks which will be converted to <br> tags."
    }
  }
} 